#include<iostream>
using namespace std;
int main()
{
	int q, * pq;
	pq = &q; // pq - присвоява адреса на q
	cout << "pq=" << pq << endl;
	cout << "&q=" << &q << endl;// &q - връща адреса на q
	//Стойностите на pq и &q са едни и същи, като на различните компютри ще се 
	//получат различни резултати. 
	q = 10;
	cout << "q=" << q << endl;
	cout << "*pq=" << *pq << endl; //*pq връща стойността, съхранявана на адреса, 
	//сочен от указателя, т.е. 10
	*pq = 20;// стойност 20 се присвоява на q посредством указателя, който сочи 
	//адреса на тази променлива
	cout << "q=" << q << endl;
	cout << "*pq=" << *pq << endl;
	cout << "&pq=" << &pq << endl;//извежда адреса на указателя
	return 0;
}